Repository: rohit455273/assertive.properties
Catalog: po/R-*.po
Languages: ar, de, es, fr, ja, ko, pt, ru

source: %s has length %d but %s has length %d.
ar: ٪ s لها طول٪ d ولكن٪ s لها طول٪ d.
de: % S hat die L채nge% d, aber% s hat die L채nge% d.
es: % S tiene longitud% d pero% s tiene longitud% d.
fr: % S a une longueur% d mais% s a une longueur% d.
ja: ％sの長さは％dですが、％sの長さは％dです。
ko: % s의 길이는 % d이지만 % s의 길이는 % d입니다.
pt: % S tem o comprimento% d mas% s tem o comprimento% d.
ru: % S имеет длину% d, но% s имеет длину% d.

source: %s has dim %s but %s has dim %s.
ar: ٪ s لديها قاتمة٪ s ولكن٪ s لديها قاتمة٪ s.
de: % S hat dim% s, aber% s hat dim% s.
es: % S tiene% s difuso pero% s tiene% s difuso.
fr: % S a dim% s mais% s a dim% s.
ja: ％sはdim％sですが、％sはdim％sです。
ko: % s에 dim % s이 (가) 있지만 % s에 dim % s이 (가) 있습니다.
pt: % S tem dim% s, mas% s tem dim% s.
ru: % S имеет dim% s, но% s имеет dim% s.

source: %s does not have all the attributes %s.
ar: ٪ s ليس لديها جميع السمات٪ s.
de: % S hat nicht alle Attribute% s.
es: % S no tiene todos los atributos% s.
fr: % S n'a pas tous les attributs% s.
ja: ％sにすべての属性％sがありません。
ko: % s에 모든 속성 % s이 (가) 없습니다.
pt: % S não tem todos os atributos% s.
ru: % S не имеет всех атрибутов% s.

source: %s does not have any of the attributes %s.
ar: ٪ s ليس لديها أي من السمات٪ s.
de: % S hat keine der Attribute% s.
es: % S no tiene ninguno de los atributos% s.
fr: % S n'a aucun des attributs% s.
ja: ％sには属性％sはありません。
ko: % s에 % s 속성이 없습니다.
pt: % S não possui nenhum dos atributos% s.
ru: % S не имеет никаких атрибутов% s.

source: %s has no duplicates.
ar: ٪ s ليس له أي نسخ مكررة.
de: % S hat keine duplikate.
es: % S no tiene duplicados.
fr: % S n'a pas de doublons.
ja: ％sに重複がありません。
ko: % s에 중복이 없습니다.
pt: % S não tem duplicatas.
ru: % S не имеет дубликатов.

source: %s has length 0.
ar: ٪ s طول 0.
de: % S hat die L채nge 0.
es: % S tiene longitud 0.
fr: % S a une longueur 0.
ja: ％sの長さは0です。
ko: % s의 길이는 0입니다.
pt: % S tem o comprimento 0.
ru: % S имеет длину 0.

source: %s has 0 elements.
ar: ٪ s تحتوي على 0 عناصر.
de: % S hat 0 Elemente.
es: % S tiene 0 elementos.
fr: % S a 0 éléments.
ja: ％sには0個の要素があります。
ko: % s에 0 개의 요소가 있습니다.
pt: % S tem 0 elementos.
ru: % S имеет 0 элементов.

source: %s has length 1.
ar: ٪ s طوله 1.
de: % S hat die L채nge 1.
es: % S tiene longitud 1.
fr: % S a une longueur 1.
ja: ％sの長さは1です。
ko: % s의 길이는 1입니다.
pt: % S tem o comprimento 1.
ru: % S имеет длину 1.

source: %s has 1 element.
ar: يحتوي٪ s على عنصر واحد.
de: % S hat 1 Element.
es: % S tiene 1 elemento.
fr: % S a 1 élément.
ja: ％sには1つの要素があります。
ko: % s에 1 개의 요소가 있습니다.
pt: % S tem 1 elemento.
ru: % S имеет 1 элемент.

source: n should be a non-negative integer vector.
ar: n يجب أن يكون ناقلا صحيحا غير سالب.
de: N sollte ein nicht-negativer Integer-Vektor sein.
es: N debe ser un vector entero no negativo.
fr: N devrait être un vecteur entier non négatif.
ja: nは負でない整数ベクトルでなければなりません。
ko: n은 음수가 아닌 정수 벡터 여야합니다.
pt: N deve ser um vetor inteiro não negativo.
ru: N должен быть неотрицательным целым вектором.

source: %s has a duplicate at position %s.
ar: ٪ s متكررة في الموضع٪ s.
de: % S hat ein Duplikat an Position% s.
es: % S tiene un duplicado en la posici贸n% s.
fr: % S a un double en position% s.
ja: ％sは位置％sに重複しています。
ko: % s에 % s 위치에 중복이 있습니다.
pt: % S tem uma duplicata na posição% s.
ru: % S имеет дубликат в позиции% s.

source: %s has %d element, not %d.
ar: ٪ s يحتوي على٪ d عنصر، وليس٪ d.
de: % S hat% d Element, nicht% d.
es: % S tiene% d elemento, no% d.
fr: % S a% d élément, pas% d.
ja: ％sは％d要素であり、％dではありません。
ko: % s에 % d 개 요소가 있지만 % d 개가 없습니다.
pt: % S tem% d elemento, não% d.
ru: % S имеет элемент% d, а не% d.

source: %s has dimension %s, not NULL.
ar: ٪ s لديها بعد٪ s، وليس نول.
de: % S hat Dimension% s, nicht NULL.
es: % S tiene la dimensi贸n% s, no NULL.
fr: % S a la dimension% s, pas NULL.
ja: ％sのディメンションは％sで、NULLではありません。
ko: % s에 NULL이 아닌 % s 차원이 있습니다.
pt: % S tem a dimensão% s, não NULL.
ru: % S имеет размерность% s, а не NULL.

source: %s has %d dimension, not %d.
ar: ٪ s لديها٪ d من الأبعاد، وليس٪ d.
de: % S hat% d Dimension, nicht% d.
es: % S tiene% d dimensi贸n, no% d.
fr: % S a% d dimension, pas% d.
ja: ％sには％d個の次元があり、％dではありません。
ko: % s이 (가) % d 차원이 아니라 % d 개 있습니다.
pt: % S tem% d dimensão, não% d.
ru: % S имеет размерность% d, а не% d.

source: Dimension %s of %s is incorrect.
ar: البعد٪ s من٪ s غير صحيح.
de: Dimension% s von% s ist falsch.
es: La dimensi贸n% s de% s es incorrecta.
fr: La dimension% s de% s est incorrecte.
ja: ％sの次元％sが正しくありません。
ko: % s의 차원 % s이 (가) 잘못되었습니다.
pt: A dimensão% s de% s está incorreta.
ru: Размер% s% s неверен.
